Revit 2024 API
FlexPipe.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>)
 Creates a new flexible pipe into the document, using a point array and flex pipe type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>)
 Creates a new flexible pipe into the document, using a point array and flex pipe type.
See Also
FlexPipe Class
FlexPipe Members
Autodesk.Revit.DB.Plumbing Namespace